In [1]:
import pandas as pd
import numpy as np

# Features of pandas:- 

- import data  sets: (csv,excel,sql)
- data cleaningng values 
- missing and
- size muteability-(add ,or, delete, column and rows)
- Reshaping and pivot table
- efficient,manipulation and extraction
- stastical analysis


# Series: It is collection which looks like 1D array.

In [2]:
s = pd.Series([22,33,54,66],name='Age')
df = s.to_frame()
df

   Age
0   22
1   33
2   54
3   66

# Difference b/w Array and Series:

- Array: Array belongs to numpy.
- It display only data.
  # Syntax: np.array(co)

- Series: Series belong to panda.
- It displays data , index, datatype.
# Syntax: pd.series(col)

#

In [3]:
s = pd.Series([22,33,54,66,55+4j],name='Age')
df = s.to_frame()
df

          Age
0  22.0+ 0.0j
1  33.0+ 0.0j
2  54.0+ 0.0j
3  66.0+ 0.0j
4  55.0+ 4.0j

# Syntax:  
          var.Values

- It will return the values in the form of array.

In [4]:
arr = np.arange(10,25)
s=pd.Series(arr)
print(s)

0     10
1     11
2     12
3     13
4     14
5     15
6     16
7     17
8     18
9     19
10    20
11    21
12    22
13    23
14    24
dtype: int64

In [5]:
s.iloc[4]

np.int64(14)

In [6]:
s

0     10
1     11
2     12
3     13
4     14
5     15
6     16
7     17
8     18
9     19
10    20
11    21
12    22
13    23
14    24
dtype: int64

In [7]:
s.iloc[[1,4,6]]

1    11
4    14
6    16
dtype: int64

In [8]:
s.iloc[1:14]

1     11
2     12
3     13
4     14
5     15
6     16
7     17
8     18
9     19
10    20
11    21
12    22
13    23
dtype: int64

# i loc:
It will return the values present as particular index.

In [9]:
df.iloc[[0,4]]

          Age
0  22.0+ 0.0j
4  55.0+ 4.0j

In [10]:
df.loc[2]

Age    54.0+ 0.0j
Name: 2, dtype: complex128

In [11]:
df.loc[2]

Age    54.0+ 0.0j
Name: 2, dtype: complex128

# Its used to fetch multiple values present on index.

In [12]:
d={'apple':120,'banana':100,'papaya':80,'kiwi':100,'orage':80,'pineapple':150}
a=pd.Series(d,name='Prices')
a

apple        120
banana       100
papaya        80
kiwi         100
orage         80
pineapple    150
Name: Prices, dtype: int64

In [13]:
d['apple']

120

In [14]:
age=pd.Series([10,12,13,14,55,66,44,12,76])
age

0    10
1    12
2    13
3    14
4    55
5    66
6    44
7    12
8    76
dtype: int64

In [15]:
age>19

0    False
1    False
2    False
3    False
4     True
5     True
6     True
7    False
8     True
dtype: bool

In [16]:
age[age>19]

4    55
5    66
6    44
8    76
dtype: int64

In [17]:
age[(age>19)&(age<44)]

Series([], dtype: int64)

In [18]:
age[-(age>19)]

0    10
1    12
2    13
3    14
7    12
dtype: int64

# DataFrame:
- It is a collection of 2d array, collection of series, collection  of row & column.

- # Syntax:

-          var=pd.DataFrame(dictionary)

In [19]:
d= {'Ename':['ankit','suraj','anuj','suyash'],
'Eid':[800,20000,20000,20000],
'Sal':['2LPA','8LPA','77LPA','6LPA']}

df = pd.DataFrame(d)
df

    Ename    Eid    Sal
0   ankit    800   2LPA
1   suraj  20000   8LPA
2    anuj  20000  77LPA
3  suyash  20000   6LPA

In [20]:
df[1:3]

   Ename    Eid    Sal
1  suraj  20000   8LPA
2   anuj  20000  77LPA

In [21]:
df['Eid']

0      800
1    20000
2    20000
3    20000
Name: Eid, dtype: int64

In [22]:
df[['Eid','Sal']]

     Eid    Sal
0    800   2LPA
1  20000   8LPA
2  20000  77LPA
3  20000   6LPA

We can apply slicing on dataframe but not apply indexing.

we can fetch column or multiple column at a time

# Syntax:

# single- var['col_name']

# multiple- var[['col_name','col_name'........]]

In [23]:
df['Sal']

0     2LPA
1     8LPA
2    77LPA
3     6LPA
Name: Sal, dtype: object

In [24]:
df['Sal'][3]

'6LPA'

- We can apply the index on particular single columnof dataframe.

#  Syntax:

- Var['col_name'][index]=new_Value

In [25]:
df['Sal'][3]='10LPA'

C:\Users\ss544\AppData\Local\Temp\ipykernel_15168\648110084.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Sal'][3]='10LPA'

In [26]:
df

    Ename    Eid    Sal
0   ankit    800   2LPA
1   suraj  20000   8LPA
2    anuj  20000  77LPA
3  suyash  20000  10LPA

In [27]:
df = pd.DataFrame({
    'Name': ['A', 'B', 'C'],
    'Marks': [90, 85, 80]
})

df['Result'] = ['Pass', 'Pass', 'Pass']

print(df)

  Name  Marks Result
0    A     90   Pass
1    B     85   Pass
2    C     80   Pass

In [28]:
df['School'] = 'K.N.I.P.S.S'

In [29]:
df['Status'] = df['Marks'].apply(lambda x: 'Pass' if x >= 80 else 'Fail')

In [30]:
df['Double_Marks'] = df['Marks'] * 2

In [31]:
df.insert(1, 'Age', [18, 19, 20])   # position 1 me column add

In [32]:
df = df.assign(Grade=['A', 'B', 'C'])

In [33]:
df['Category'] = ['Topper' if x > 85 else 'Average' for x in df['Marks']]

In [34]:
df

  Name  Age  Marks Result       School Status  Double_Marks Grade Category
0    A   18     90   Pass  K.N.I.P.S.S   Pass           180     A   Topper
1    B   19     85   Pass  K.N.I.P.S.S   Pass           170     B  Average
2    C   20     80   Pass  K.N.I.P.S.S   Pass           160     C  Average

In [35]:
df = pd.DataFrame({
    'Roll_No': [101, 102, 103, 104],
    'Student_Name': ['Rahul', 'Priya', 'Amit', 'Sneha'],
    'Course': ['BCA', 'BBA', 'B.Sc', 'BA'],
    'Year': [1, 2, 1, 3],
    'Marks': [85, 78, 92, 88]
})

print(df)

   Roll_No Student_Name Course  Year  Marks
0      101        Rahul    BCA     1     85
1      102        Priya    BBA     2     78
2      103         Amit   B.Sc     1     92
3      104        Sneha     BA     3     88

In [36]:
df[1:3]

   Roll_No Student_Name Course  Year  Marks
1      102        Priya    BBA     2     78
2      103         Amit   B.Sc     1     92

In [37]:
df['Roll_No']

0    101
1    102
2    103
3    104
Name: Roll_No, dtype: int64

In [38]:
df[['Roll_No','Year']]

   Roll_No  Year
0      101     1
1      102     2
2      103     1
3      104     3

In [39]:
df['Marks']

0    85
1    78
2    92
3    88
Name: Marks, dtype: int64

In [40]:
df['Year'][3]

np.int64(3)

In [41]:
df=pd.read_csv('https://github.com/Taj1920/Data-Analysis-Datasets/raw/refs/heads/main/Datasets-Practice/hr_data.csv')
df

,employee_id,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,department,salary
0,1003,2,157,3,0,1,0,sales,low
1,1005,5,262,6,0,1,0,sales,medium
2,1486,7,272,4,0,1,0,sales,medium
3,1038,5,223,5,0,1,0,sales,low
4,1057,2,159,3,0,1,0,sales,low
...,...,...,...,...,...,...,...,...,...
14994,87670,2,151,3,0,1,0,support,low
14995,87673,2,160,3,0,1,0,support,low
14996,87679,2,143,3,0,1,0,support,low
14997,87681,6,280,4,0,1,0,support,low
14998,87684,2,158,3,0,1,0,support,low

In [42]:
df=pd.read_csv('https://github.com/Taj1920/Data-Analysis-Datasets/raw/refs/heads/main/Datasets-Practice/amazon_fires.csv',encoding='ISO-8859-1')
df

       ano       mes     estado   numero  encontro
0     1998   Janeiro       Acre  0 Fires  1/1/1998
1     1999   Janeiro       Acre  0 Fires  1/1/1999
2     2000   Janeiro       Acre  0 Fires  1/1/2000
3     2001   Janeiro       Acre  0 Fires  1/1/2001
4     2002   Janeiro       Acre  0 Fires  1/1/2002
...    ...       ...        ...      ...       ...
6449  2012  Dezembro  Tocantins      128  1/1/2012
6450  2013  Dezembro  Tocantins       85  1/1/2013
6451  2014  Dezembro  Tocantins      223  1/1/2014
6452  2015  Dezembro  Tocantins      373  1/1/2015
6453  2016  Dezembro  Tocantins      119  1/1/2016

[6454 rows x 5 columns]

In [43]:
df.head()

# It will display top 5 rows

    ano      mes estado   numero  encontro
0  1998  Janeiro   Acre  0 Fires  1/1/1998
1  1999  Janeiro   Acre  0 Fires  1/1/1999
2  2000  Janeiro   Acre  0 Fires  1/1/2000
3  2001  Janeiro   Acre  0 Fires  1/1/2001
4  2002  Janeiro   Acre  0 Fires  1/1/2002

# To display five rows:

# Syntax:-
- var.head()

# Why this is use to n number of rows:
# It will display top n number of rows.
# Syntax:-

- var.head(n)

In [44]:
df.head(10)

    ano      mes estado    numero  encontro
0  1998  Janeiro   Acre   0 Fires  1/1/1998
1  1999  Janeiro   Acre   0 Fires  1/1/1999
2  2000  Janeiro   Acre   0 Fires  1/1/2000
3  2001  Janeiro   Acre   0 Fires  1/1/2001
4  2002  Janeiro   Acre   0 Fires  1/1/2002
5  2003  Janeiro   Acre  10 Fires  1/1/2003
6  2004  Janeiro   Acre   0 Fires  1/1/2004
7  2005  Janeiro   Acre  12 Fires  1/1/2005
8  2006  Janeiro   Acre   4 Fires  1/1/2006
9  2007  Janeiro   Acre   0 Fires  1/1/2007

In [45]:
df.tail()

       ano       mes     estado numero  encontro
6449  2012  Dezembro  Tocantins    128  1/1/2012
6450  2013  Dezembro  Tocantins     85  1/1/2013
6451  2014  Dezembro  Tocantins    223  1/1/2014
6452  2015  Dezembro  Tocantins    373  1/1/2015
6453  2016  Dezembro  Tocantins    119  1/1/2016

# To display last 5 row:

# Syntax: 
- var.tail()

# To display n number of rows from bottom:

# syntax:
- var.tail(n)

In [46]:
df.describe()

               ano
count  6454.000000
mean   2007.461729
std       5.746654
min    1998.000000
25%    2002.000000
50%    2007.000000
75%    2012.000000
max    2017.000000

# It will return the stastical information about data frame.

- It will working on only numeric data.

# Syntax:

-var.describe()

In [47]:
df.describe(include=object)

            mes estado numero  encontro
count      6454   6454   6322      6454
unique       12     23   1728        20
top     Janeiro    Rio      0  1/1/1998
freq        541    717    433       324

In [48]:
df['mes'].unique()

array(['Janeiro', 'Fevereiro', 'Março', 'Abril', 'Maio', 'Junho', 'Julho',
       'Agosto', 'Setembro', 'Outubro', 'Novembro', 'Dezembro'],
      dtype=object)

In [49]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6454 entries, 0 to 6453
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   ano       6454 non-null   int64
 1   mes       6454 non-null   object
 2   estado    6454 non-null   object
 3   numero    6322 non-null   object
 4   encontro  6454 non-null   object
dtypes: int64(1), object(4)
memory usage: 252.2+ KB

In [50]:
df.value_counts()

ano   mes        estado     numero  encontro
1998  Maio       Rio        0       1/1/1998    3
      Março      Rio        0       1/1/1998    3
      Janeiro    Rio        0       1/1/1998    3
      Abril      Rio        0       1/1/1998    3
      Fevereiro  Rio        0       1/1/1998    3
                                               ..
2017  Setembro   Sergipe    0       1/1/2017    1
                 Tocantins  10.737  1/1/2017    1
                 alagoas    4       1/1/2017    1
                 pará       25.004  1/1/2017    1
1998  Abril      Amapa      0       1/1/1998    1
Name: count, Length: 6292, dtype: int64

- it will return the complete information about DataFrame.

# Syntax:
    Var.info()

# Syntax:
- var['col_name'].unique()

- It will count  how many times a unique value got repeated.

# Syntax:

- var['col_name]value_counts()

In [51]:
df['mes'].value_counts()

mes
Janeiro      541
Fevereiro    540
Março        540
Abril        540
Maio         540
Junho        540
Julho        540
Agosto       540
Setembro     540
Outubro      540
Novembro     540
Dezembro     513
Name: count, dtype: int64

In [52]:
df=pd.read_csv('https://github.com/Taj1920/Data-Analysis-Datasets/raw/refs/heads/main/Datasets-Practice/winequalityN.csv')
df

,type,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality
0,white,7.0,0.270,0.36,20.7,0.045,45.0,170.0,1.00100,3.00,0.45,8.8,6
1,white,6.3,0.300,0.34,1.6,0.049,14.0,132.0,0.99400,3.30,0.49,9.5,6
2,white,8.1,0.280,0.40,6.9,0.050,30.0,97.0,0.99510,3.26,0.44,10.1,6
3,white,7.2,0.230,0.32,8.5,0.058,47.0,186.0,0.99560,3.19,0.40,9.9,6
4,white,7.2,0.230,0.32,8.5,0.058,47.0,186.0,0.99560,3.19,0.40,9.9,6
...,...,...,...,...,...,...,...,...,...,...,...,...,...
6492,red,6.2,0.600,0.08,2.0,0.090,32.0,44.0,0.99490,3.45,0.58,10.5,5
6493,red,5.9,0.550,0.10,2.2,0.062,39.0,51.0,0.99512,3.52,NaN,11.2,6
6494,red,6.3,0.510,0.13,2.3,0.076,29.0,40.0,0.99574,3.42,0.75,11.0,6
6495,red,5.9,0.645,0.12,2.0,0.075,32.0,44.0,0.99547,3.57,0.71,10.2,5
6496,red,6.0,0.310,0.47,3.6,0.067,18.0,42.0,0.99549,3.39,0.66,11.0,6

In [53]:
df.describe(include=object)

         type
count    6497
unique      2
top     white
freq     4898

- It will return the stastical information including object data as well.

# Syntax:

- var.describe(include=object)

In [54]:
df.head()

,type,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality
0,white,7.0,0.27,0.36,20.7,0.045,45.0,170.0,1.0010,3.00,0.45,8.8,6
1,white,6.3,0.30,0.34,1.6,0.049,14.0,132.0,0.9940,3.30,0.49,9.5,6
2,white,8.1,0.28,0.40,6.9,0.050,30.0,97.0,0.9951,3.26,0.44,10.1,6
3,white,7.2,0.23,0.32,8.5,0.058,47.0,186.0,0.9956,3.19,0.40,9.9,6
4,white,7.2,0.23,0.32,8.5,0.058,47.0,186.0,0.9956,3.19,0.40,9.9,6

In [55]:
df.shape

(6497, 13)

# It will return no. of  rows and no. of column.

# Syntax:
-df.shape

In [56]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6497 entries, 0 to 6496
Data columns (total 13 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   type                  6497 non-null   object
 1   fixed acidity         6487 non-null   float64
 2   volatile acidity      6489 non-null   float64
 3   citric acid           6494 non-null   float64
 4   residual sugar        6495 non-null   float64
 5   chlorides             6495 non-null   float64
 6   free sulfur dioxide   6497 non-null   float64
 7   total sulfur dioxide  6497 non-null   float64
 8   density               6497 non-null   float64
 9   pH                    6488 non-null   float64
 10  sulphates             6493 non-null   float64
 11  alcohol               6497 non-null   float64
 12  quality               6497 non-null   int64
dtypes: float64(11), int64(1), object(1)
memory usage: 660.0+ KB

In [57]:
df.value_counts()

type   fixed acidity  volatile acidity  citric acid  residual sugar  chlorides  free sulfur dioxide  total sulfur dioxide  density  pH    sulphates  alcohol  quality
white  7.0            0.15              0.28         14.7            0.051      29.0                 149.0                 0.99792  2.96  0.39       9.0      7          8
       7.3            0.19              0.27         13.9            0.057      45.0                 155.0                 0.99807  2.94  0.41       8.8      8          8
       6.8            0.18              0.30         12.8            0.062      19.0                 171.0                 0.99808  3.00  0.52       9.0      7          7
       7.4            0.16              0.30         13.7            0.056      33.0                 168.0                 0.99825  2.90  0.44       8.7      7          7
                                        0.27         15.5            0.050      25.0                 135.0                 0.99840  2.90  0.43       8.7      7          6
                                                                                                                                                                        ..
       10.3           0.17              0.47         1.4             0.037      5.0                  33.0                  0.99390  2.89  0.28       9.6      3          1
                      0.25              0.48         2.2             0.042      28.0                 164.0                 0.99800  3.19  0.59       9.7      5          1
red    7.9            0.49              0.32         1.9             0.082      17.0                 144.0                 0.99680  3.20  0.55       9.5      5          1
white  11.8           0.23              0.38         11.1            0.034      15.0                 123.0                 0.99970  2.93  0.55       9.7      3          1
       9.6            0.23              0.40         1.5             0.044      19.0                 135.0                 0.99370  2.96  0.49       10.9     5          1
Name: count, Length: 5295, dtype: int64

# df.value_counts()

- it will count repeated value

- It will return the count of values.

In [58]:
df.columns

Index(['type', 'fixed acidity', 'volatile acidity', 'citric acid',
       'residual sugar', 'chlorides', 'free sulfur dioxide',
       'total sulfur dioxide', 'density', 'pH', 'sulphates', 'alcohol',
       'quality'],
      dtype='object')

# var.columns

# It will return the all the columns name

In [59]:
df.sample()

,type,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality
1945,white,8.1,0.26,0.3,7.8,0.049,39.0,152.0,0.9954,2.99,0.58,10.0,6

In [60]:
df.sample(8)

,type,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality
4567,white,5.8,0.28,0.66,9.1,0.039,26.0,159.0,0.99650,3.66,0.55,10.8,5
883,white,7.4,0.26,0.43,6.0,0.022,22.0,125.0,0.99280,3.13,0.55,11.5,6
1125,white,6.3,0.55,0.45,13.0,0.047,33.0,182.0,0.99740,3.20,0.46,9.2,6
6449,red,7.1,0.67,0.00,2.3,0.083,18.0,27.0,0.99768,3.44,0.54,9.4,5
4144,white,6.8,0.28,0.29,11.9,0.052,51.0,149.0,0.99544,3.02,0.58,10.4,6
4088,white,7.3,0.25,0.27,3.8,0.047,16.0,79.0,0.99173,3.07,0.46,11.3,6
1337,white,6.7,0.18,0.30,6.4,0.048,40.0,251.0,0.99560,3.29,0.52,10.0,5
5161,red,7.9,0.37,0.23,1.8,0.077,23.0,49.0,0.99630,3.28,0.67,9.3,5

# var.sample()

- It will fetch the random rows from the data frame.

- it will fetch the random number of rows.

- n Number of rows

- df.sample(n)

In [61]:
df

,type,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality
0,white,7.0,0.270,0.36,20.7,0.045,45.0,170.0,1.00100,3.00,0.45,8.8,6
1,white,6.3,0.300,0.34,1.6,0.049,14.0,132.0,0.99400,3.30,0.49,9.5,6
2,white,8.1,0.280,0.40,6.9,0.050,30.0,97.0,0.99510,3.26,0.44,10.1,6
3,white,7.2,0.230,0.32,8.5,0.058,47.0,186.0,0.99560,3.19,0.40,9.9,6
4,white,7.2,0.230,0.32,8.5,0.058,47.0,186.0,0.99560,3.19,0.40,9.9,6
...,...,...,...,...,...,...,...,...,...,...,...,...,...
6492,red,6.2,0.600,0.08,2.0,0.090,32.0,44.0,0.99490,3.45,0.58,10.5,5
6493,red,5.9,0.550,0.10,2.2,0.062,39.0,51.0,0.99512,3.52,NaN,11.2,6
6494,red,6.3,0.510,0.13,2.3,0.076,29.0,40.0,0.99574,3.42,0.75,11.0,6
6495,red,5.9,0.645,0.12,2.0,0.075,32.0,44.0,0.99547,3.57,0.71,10.2,5
6496,red,6.0,0.310,0.47,3.6,0.067,18.0,42.0,0.99549,3.39,0.66,11.0,6

In [62]:
df.sort_values('citric acid')

,type,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality
6451,red,7.3,0.735,0.00,2.2,0.080,18.0,28.0,0.99765,3.41,0.60,9.4,5
6449,red,7.1,0.670,0.00,2.3,0.083,18.0,27.0,0.99768,3.44,0.54,9.4,5
6448,red,7.1,0.680,0.00,2.3,0.087,17.0,26.0,0.99783,3.45,0.53,9.5,5
5136,red,7.2,0.630,0.00,1.9,0.097,14.0,38.0,0.99675,3.37,0.58,9.0,6
6052,red,6.6,0.580,0.00,2.2,0.100,50.0,63.0,0.99544,3.59,0.68,11.4,6
...,...,...,...,...,...,...,...,...,...,...,...,...,...
3152,white,7.6,0.250,1.23,4.6,0.035,51.0,294.0,0.99018,3.03,0.43,13.1,6
745,white,7.4,0.200,1.66,2.1,0.022,34.0,113.0,0.99165,3.26,0.55,12.2,6
268,white,5.3,0.585,NaN,7.1,0.044,34.0,145.0,0.99450,3.34,0.57,9.7,6
909,white,7.5,0.240,NaN,13.0,0.049,46.0,217.0,0.99850,3.08,0.53,8.8,5
6320,red,7.0,0.540,NaN,2.1,0.079,39.0,55.0,0.99560,3.39,0.84,11.4,6

In [63]:
df.sort_values('chlorides')

,type,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality
3773,white,5.0,0.61,0.12,1.3,0.009,65.0,100.0,0.98740,3.26,0.37,13.5,5
2631,white,6.7,0.28,0.28,2.4,0.012,36.0,100.0,0.99064,3.26,0.39,11.7,7
5735,red,6.7,0.28,0.28,2.4,0.012,36.0,100.0,0.99064,3.26,0.39,11.7,7
5734,red,6.7,0.28,0.28,2.4,0.012,36.0,100.0,0.99064,3.26,0.39,11.7,7
3901,white,4.8,0.65,0.12,1.1,0.013,4.0,10.0,0.99246,3.32,0.36,13.5,4
...,...,...,...,...,...,...,...,...,...,...,...,...,...
5004,red,7.8,0.41,0.68,1.7,0.467,18.0,69.0,0.99730,3.08,1.31,9.3,5
5049,red,9.2,0.52,1.00,3.4,0.610,32.0,69.0,0.99960,2.74,2.00,9.4,4
5156,red,7.7,0.41,0.76,1.8,0.611,8.0,45.0,0.99680,3.06,1.26,9.4,5
98,white,9.8,0.36,0.46,10.5,NaN,4.0,83.0,0.99560,2.89,0.30,10.1,4
747,white,7.2,0.29,0.40,7.6,NaN,56.0,177.0,0.99280,3.04,0.32,11.5,6

# df.sort_values(by='col_name')

- It will short the data frame based on one particular column.

- It will short the ascending mannner.

In [64]:
df.head()

,type,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality
0,white,7.0,0.27,0.36,20.7,0.045,45.0,170.0,1.0010,3.00,0.45,8.8,6
1,white,6.3,0.30,0.34,1.6,0.049,14.0,132.0,0.9940,3.30,0.49,9.5,6
2,white,8.1,0.28,0.40,6.9,0.050,30.0,97.0,0.9951,3.26,0.44,10.1,6
3,white,7.2,0.23,0.32,8.5,0.058,47.0,186.0,0.9956,3.19,0.40,9.9,6
4,white,7.2,0.23,0.32,8.5,0.058,47.0,186.0,0.9956,3.19,0.40,9.9,6

In [65]:
df.loc[20:30]

,type,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality
20,white,6.2,0.66,0.48,1.2,0.029,29.0,75.0,0.9892,3.33,0.39,12.8,8
21,white,6.4,0.31,0.38,2.9,0.038,19.0,102.0,0.9912,3.17,0.35,11.0,7
22,white,6.8,0.26,0.42,1.7,0.049,41.0,122.0,0.9930,3.47,0.48,10.5,8
23,white,7.6,0.67,0.14,1.5,0.074,25.0,168.0,0.9937,3.05,0.51,9.3,5
24,white,6.6,0.27,0.41,1.3,0.052,16.0,142.0,0.9951,3.42,0.47,10.0,6
25,white,7.0,0.25,0.32,9.0,0.046,56.0,245.0,0.9955,3.25,0.50,10.4,6
26,white,6.9,0.24,0.35,1.0,0.052,35.0,146.0,0.9930,3.45,0.44,10.0,6
27,white,7.0,0.28,0.39,8.7,0.051,32.0,141.0,0.9961,3.38,0.53,10.5,6
28,white,7.4,0.27,0.48,1.1,0.047,17.0,132.0,0.9914,3.19,0.49,11.6,6
29,white,7.2,0.32,0.36,2.0,0.033,37.0,114.0,0.9906,3.10,0.71,12.3,7
30,white,8.5,0.24,0.39,10.4,0.044,20.0,142.0,0.9974,3.20,0.53,10.0,6

# Slicing on dataframe:

- It will slice the dataframe based on index.

# Syntax:

- var.loc[index]

- It will return all the data of column for particular column.

In [66]:
df.loc[5856]

type                        red
fixed acidity               6.4
volatile acidity           0.57
citric acid                0.12
residual sugar              2.3
chlorides                  0.12
free sulfur dioxide        25.0
total sulfur dioxide       36.0
density                 0.99519
pH                         3.47
sulphates                  0.71
alcohol                    11.3
quality                       7
Name: 5856, dtype: object

In [67]:
df.loc[20:30:2,'type']

20    white
22    white
24    white
26    white
28    white
30    white
Name: type, dtype: object

# multiple column in list
 
- It will sgive the data of particular column as per mentioned indexes.

# Syntax:
          var.loc(sv:ev+-1:step)

In [68]:
df.loc[20:30:2,['type','pH']]

     type    pH
20  white  3.33
22  white  3.47
24  white  3.42
26  white  3.45
28  white  3.19
30  white  3.20

In [69]:
df=pd.read_csv('https://github.com/Taj1920/Data-Analysis-Datasets/raw/refs/heads/main/Datasets-Practice/tips.csv')
df

     Unnamed: 0  total_bill   tip     sex smoker   day    time  size
0             0       16.99  1.01  Female     No   Sun  Dinner     2
1             1       10.34  1.66    Male     No   Sun  Dinner     3
2             2       21.01  3.50    Male     No   Sun  Dinner     3
3             3       23.68  3.31    Male     No   Sun  Dinner     2
4             4       24.59  3.61  Female     No   Sun  Dinner     4
..          ...         ...   ...     ...    ...   ...     ...   ...
239         239       29.03  5.92    Male     No   Sat  Dinner     3
240         240       27.18  2.00  Female    Yes   Sat  Dinner     2
241         241       22.67  2.00    Male    Yes   Sat  Dinner     2
242         242       17.82  1.75    Male     No   Sat  Dinner     2
243         243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 8 columns]

In [70]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  244 non-null    int64
 1   total_bill  244 non-null    float64
 2   tip         244 non-null    float64
 3   sex         244 non-null    object
 4   smoker      244 non-null    object
 5   day         244 non-null    object
 6   time        244 non-null    object
 7   size        244 non-null    int64
dtypes: float64(2), int64(2), object(4)
memory usage: 15.4+ KB

In [71]:
df.columns

Index(['Unnamed: 0', 'total_bill', 'tip', 'sex', 'smoker', 'day', 'time',
       'size'],
      dtype='object')

In [72]:
df.sample(8)

     Unnamed: 0  total_bill   tip     sex smoker   day    time  size
54           54       25.56  4.34    Male     No   Sun  Dinner     4
77           77       27.20  4.00    Male     No  Thur   Lunch     4
239         239       29.03  5.92    Male     No   Sat  Dinner     3
124         124       12.48  2.52  Female     No  Thur   Lunch     2
99           99       12.46  1.50    Male     No   Fri  Dinner     2
51           51       10.29  2.60  Female     No   Sun  Dinner     2
26           26       13.37  2.00    Male     No   Sat  Dinner     2
116         116       29.93  5.07    Male     No   Sun  Dinner     4

In [73]:
df.sort_values('tip')

     Unnamed: 0  total_bill    tip     sex smoker   day    time  size
92           92        5.75   1.00  Female    Yes   Fri  Dinner     2
111         111        7.25   1.00  Female     No   Sat  Dinner     1
67           67        3.07   1.00  Female    Yes   Sat  Dinner     1
236         236       12.60   1.00    Male    Yes   Sat  Dinner     2
0             0       16.99   1.01  Female     No   Sun  Dinner     2
..          ...         ...    ...     ...    ...   ...     ...   ...
141         141       34.30   6.70    Male     No  Thur   Lunch     6
59           59       48.27   6.73    Male     No   Sat  Dinner     4
23           23       39.42   7.58    Male     No   Sat  Dinner     4
212         212       48.33   9.00    Male     No   Sat  Dinner     4
170         170       50.81  10.00    Male    Yes   Sat  Dinner     3

[244 rows x 8 columns]

In [74]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  244 non-null    int64
 1   total_bill  244 non-null    float64
 2   tip         244 non-null    float64
 3   sex         244 non-null    object
 4   smoker      244 non-null    object
 5   day         244 non-null    object
 6   time        244 non-null    object
 7   size        244 non-null    int64
dtypes: float64(2), int64(2), object(4)
memory usage: 15.4+ KB

In [75]:
df.sort_values('sex')

     Unnamed: 0  total_bill   tip     sex smoker   day    time  size
0             0       16.99  1.01  Female     No   Sun  Dinner     2
139         139       13.16  2.75  Female     No  Thur   Lunch     2
137         137       14.15  2.00  Female     No  Thur   Lunch     2
136         136       10.33  2.00  Female     No  Thur   Lunch     2
135         135        8.51  1.25  Female     No  Thur   Lunch     2
..          ...         ...   ...     ...    ...   ...     ...   ...
43           43        9.68  1.32    Male     No   Sun  Dinner     2
42           42       13.94  3.06    Male     No   Sun  Dinner     2
41           41       17.46  2.54    Male     No   Sun  Dinner     2
39           39       31.27  5.00    Male     No   Sat  Dinner     3
156         156       48.17  5.00    Male     No   Sun  Dinner     6

[244 rows x 8 columns]

In [76]:
df.loc[58]

Unnamed: 0        58
total_bill     11.24
tip             1.76
sex             Male
smoker           Yes
day              Sat
time          Dinner
size               2
Name: 58, dtype: object

In [77]:
df.shape

(244, 8)

In [78]:
df.head()

   Unnamed: 0  total_bill   tip     sex smoker  day    time  size
0           0       16.99  1.01  Female     No  Sun  Dinner     2
1           1       10.34  1.66    Male     No  Sun  Dinner     3
2           2       21.01  3.50    Male     No  Sun  Dinner     3
3           3       23.68  3.31    Male     No  Sun  Dinner     2
4           4       24.59  3.61  Female     No  Sun  Dinner     4

In [79]:
df.tail()

     Unnamed: 0  total_bill   tip     sex smoker   day    time  size
239         239       29.03  5.92    Male     No   Sat  Dinner     3
240         240       27.18  2.00  Female    Yes   Sat  Dinner     2
241         241       22.67  2.00    Male    Yes   Sat  Dinner     2
242         242       17.82  1.75    Male     No   Sat  Dinner     2
243         243       18.78  3.00  Female     No  Thur  Dinner     2

# var['col_name].unique()

- it will return particular unique value present in column

# Slicing on dataframe:

- It will return slice the dataframe on the indexes.

- var.loc[SV:E